{"config": [{"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "axis": -1, "epsilon": 1e-05, "gamma_constraint": null, "batch_input_shape": [null, 32, 12], "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_1", "center": true}, "class_name": "BatchNormalization"}, {"config": {"layer": {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "return_state": false, "stateful": false, "go_backwards": false, "name": "gru_1", "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "units": 90, "recurrent_dropout": 0.0, "unroll": false}, "class_name": "GRU"}, "trainable": true, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "return_state": false, "stateful": false, "go_backwards": false, "name": "gru_2", "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "units": 90, "recurrent_dropout": 0.0, "unroll": false}, "class_name": "GRU"}, "trainable": true, "name": "bidirectional_2", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 62, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}, "trainable": true, "name": "time_distributed_1"}, "class_name": "TimeDistributed"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "axis": -1, "epsilon": 1e-05, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_2", "center": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow"}